<?php


namespace app\enum;


class BalanceRecordEnum
{
    //类型
    const TYPE = [
        1 => '充值',
        2 => '消费'
    ];

    //消费方式
    const STATE = [
        1 => '充值',
        2 => '推荐入驻',
        3 => '锁客返利',
        4 => '推广返利',
        5 => '提现',
        6 => '提现退款',
        7 => '用户支付抢购价',
        8 => '礼包支付',
        9 => '推荐人充值积分返利',
        10 => '领取优惠券支付',
        11 => '商家入驻支付',
        12 => '积分充值支付',
        13 => '余额充值支付',
        14 => '卡券剩余金额支付'
    ];

    //类型
    const PAY_TYPE = [
        1 => '余额',
        2 => '微信支付'
    ];
}